plantalog/cadi-gcl/stm32f100/current/main.c
/*
 *  Use this code free of charge, but leave this text box here, 
 *  This code is distributed as is with no warranties.
 *  https://github.com/plantalog/ is main repository hub for Cadi project.
 *
 *	27.08.2013 changed the virtaddvartab usage to copying the whole row or variables 0x05C0-0x0679
 *
 *
 */

#include "stm32f10x_it.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_tim.h"
#include "misc.h"
#include "stm32f10x.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_dma.h"
#include "stm32f10x_exti.h"
#include "stm32f10x_conf.h"
#include "stm32f10x_usart.h"
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "stm32f10x_flash.h"
#include "eeprom.h"
#include "ff9a/src/diskio.h"
#include "ff9a/src/ff.h"


// enabling test mode adds some test functionality
#define	TEST_MODE

// enabling USE_VALVES turns on the valve control processing. Disable USART if using this define
// #define USE_VALVES

#define BT_USART	USART1
#define BLUETOOTH_ON

#ifdef BLUETOOTH_ON

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define USARTx_IRQHandler   USART1_IRQHandler

//#define TxBufferSize   (countof(TxBuffer) - 1)
//#define RxBufferSize   0x10

/* Private macro -------------------------------------------------------------*/
#define countof(a)   (sizeof(a) / sizeof(*(a)))

/* Private variables ---------------------------------------------------------*/
// uint8_t TxBuffer[] = "\n\rCadi sends HELLO!\n\r";
uint8_t RxBuffer[10];
uint8_t RxByte;
uint8_t TxByte;
uint8_t comm_state=48;	// communication state
uint8_t TxDataReady;
uint8_t RxDataReady;
// uint8_t RxDataReady;
//uint8_t NbrOfDataToTransfer = TxBufferSize;
//uint8_t NbrOfDataToRead = RxBufferSize;
uint8_t TxCounter = 0;
uint16_t RxCounter = 0;


#endif



// define eeprom cells for keeping settings

#define PLUG_DISABLE	GPIOC->BSRR
#define PLUG_ENABLE		GPIOC->BRR

#define VALVE_DISABLE	GPIOA->BSRR
#define VALVE_ENABLE	GPIOA->BRR

#define	PLUG_INVERT			0		// enable reverse plugStateSet
#define EE_PLUG_SETTINGS	0x05FF	//	each plug one value (16 plugs in total, range 7FF-809)
#define EE_TIMER1_ON		0x05DA	// for 4 timers 36 (hex=24) values (range: 7DA-7FF)
#define EE_CTIMER_DURATION	0x05C0	// 2 values for duration of cTimer.
#define EE_CTIMER_INTERVAL	0x05C2	// and 2 for interval. For 5 timers 25 (hex=19) values 7C0-7D9
#define EE_TIMER_SIZE		9
#define EE_CTIMER_SIZE		5
#define PLUG_AMOUNT			3		// this links to number of pins on PORTC, so not more then 16
#define PH4_ADDR			0x0600
#define PH7_ADDR			0x0601
#define PH_INTERVAL			0x0602		// pH measurement interval in milliseconds
#define PH_BUFF_SIZE		0x0603		// pH buffer size
#define PH_WINDOW_TOP		0x0604		// pH window top adc value
#define PH_WINDOW_BOTTOM	0x0605	// pH window bottom adc value
#define SD_LOG_INTERVAL		0x0609		// sd logging interval, seconds
#define BUTTON_RANGES_START_ADDR	0x060A	// button ranges (8 values in a row) 60A-612

#define EC1413_ADDR			0x0606
#define EC0_ADDR			0x067E	// after FMPs

#define RH_WINDOW_TOP		0x0607		// pH window top adc value
#define RH_WINDOW_BOTTOM	0x0608	// pH window bottom adc value

#define CIRCULATION_PUMP_ID_ADDR	0x0899		// seems not to be used due to overriding with timerId=70


// WATERING PROGRAMS SETTINGS ADRESSES
#define WP_AMOUNT					3		// 3x16=48(hex=30) values (range: 613-643)
#define WP_SIZE						16		// size of block of settings data of watering program
#define WP_OFFSET					0x0613	// watering program settings offset
#define TOP_WATER_SENSOR_SHIFT		1		// water sensor address offset inside watering program
#define BOTTOM_WATER_SENSOR_SHIFT	2		// water sensor address offset inside watering program
#define WATER_FILL_TIMEOUT_SHIFT	3		// if no sensor reached timout for water tank fill valve
#define WP_DURATION_SHIFT			4		// ready solution watering duration
#define WP_INTERVAL_SHIFT			5		// 2x16bit variables for program execution interval
#define WP_START_TIME_SHIFT			7		// 2x16bit variables for program start time
#define WP_LAST_RUN_SHIFT			9		// 2x16bit last run of watering program
// #define WP_CIRCULATION_PUMP_PLUG_SHIFT		11		// circulation pump plug nr
#define WP_WATERING_PUMP_PLUG_ID	11
#define WP_ENABLE_SHIFT				12
#define WP_END_TIME_SHIFT			13
#define WP_DRAIN_DURATION_SHIFT		15



// 9x7=63 (hex=39) 0x0644 - 0x067D

#define FMP_PROGRAMS_AMOUNT			9

// Fertilizer Mixing Program adresses	()
#define FMP_OFFSET								0x0644
#define FMP_SIZE								7
#define FMP_DOSING_PUMP_ID_SHIFT				1
#define FMP_DOSING_TIME_SHIFT					2
#define FMP_CIRCULATION_MIXING_TIME_SHIFT		3
#define FMP_2_WP_ASSOC_SHIFT					4
#define FMP_TRIG_FREQUENCY_SHIFT				5
#define FMP_ENABLE								6

#define COMM_MONITOR_MODE		48
#define COMM_GET_SETTINGS		49
#define COMM_SET_SETTINGS		50
#define SETTINGS_PACKET_SIZE	200	// look NumbOfVar define in eeprom.h
#define SETTINGS_START_ADDR		0x05C0	// HARDCODED in eeprom.c look for this address




#define YEAR12SECS				1325462400	// vse raschety vedjom ot 01.01.2012
#define BUTTON_OK				2
#define BUTTON_CNL				3
#define BUTTON_BCK				1
#define BUTTON_FWD				4
#define BUTTON_RANGE_SHRINKER	0
#define DAY						1
#define NIGHT					0
#define port    				GPIOB
#define init_port 				RCC_APB2Periph_GPIOB
#define pin_e 					GPIO_Pin_7
#define pin_rw					GPIO_Pin_8
#define pin_rs					GPIO_Pin_9
#define lcd_port				GPIOB
#define BSRRL					BSRR
#define BSRRH					BRR
#define DHT_TRIG_PLUG			15		// PB15

#define DHT_DATA_START_POINTER	4		// DHT22 = 4, DHT11 = ?; sets the first bit number in captured sequence of DHT response bits
#define DHT_0					(GPIOB->BRR = (1<<DHT_TRIG_PLUG))
#define DHT_1					(GPIOB->BSRR = (1<<DHT_TRIG_PLUG))
#define LOG_SHIFT	1

// Valves
#define VALVE_SENSOR_GPIO_SHIFT		10		// valve position sensor GPIO shift
#define VALVE_AMOUNT				3		// number of valves to process
#define VALVE_MOTOR_GPIO_SHIFT		8		// valve control motor GPIO out shift
#define VALVE_MOTOR_PORT			GPIOA
#define VALVE_SENSOR_PORT			GPIOC
#define V1_SENSOR_PIN				GPIO_Pin_10
#define V2_SENSOR_PIN				GPIO_Pin_11
#define V3_SENSOR_PIN				GPIO_Pin_12

