plantalog/cadi-gcl/stm32f100/current/main.c
#define DRAIN_VALVE_ID				1

// analog inputs
#define JDR_BUTTONS	ADC1->JDR4		// continuous ADC channel for buttons
#define JDR_EC		ADC1->JDR3		// continuous ADC channel for EC
#define JDR_PH		ADC1->JDR2		// continuous ADC channel for pH

// lcd 1602 or 44780 defines
#define lcd_shift	11				// seems to be not used here anymore?
#define use_gpio	GPIO_Pin_13		// last data pin number
#define pin_d7		use_gpio		// define pins from last
#define pin_d6		use_gpio>>1
#define pin_d5		use_gpio>>2
#define pin_d4		use_gpio>>3		// to d4 of 4bit bus of 1602 LCD

#define Function_set 				0b00100000//4-bit,2 - line mode, 5*8 dots
#define Display_on_off_control		0b00001100/// display on,cursor off,blink off
#define Display_clear				0b00000001
#define Entry_mode_set				0b00000100//

#define rs_1	port->ODR |=  pin_rs
#define rs_0	port->ODR &=~ pin_rs
#define e_1 	port->ODR |=  pin_e
#define e_0		port->ODR &=~ pin_e
#define rw_1	port->ODR |=  pin_rw
#define rw_0	port->ODR &=~ pin_rw
u32 del;

typedef struct
{
  unsigned char  hour;
  unsigned char  min;
  unsigned char  sec;
} RTC_Time;

typedef struct
{
  uint16_t  hour;
  uint16_t  min;
  uint16_t  sec;
  uint16_t  day;
  uint16_t  month;
  uint16_t  year;
  uint16_t  doy;	   //day of year

} RTC_DateTime;

typedef struct
{
  uint16_t 			DHT_Temperature;        // temperature
  uint16_t 			DHT_Humidity;  // from 0 (0%) to 1000 (100%)
  uint8_t 			DHT_CRC;  // from 0 (0%) to 1000 (100%)
}DHT_data;

uint8_t log_inc=0;
char log_str[64];
uint8_t logstr_crc=0;

__IO uint16_t IC2Value = 0;
__IO uint16_t DutyCycle = 0;
__IO uint32_t Frequency = 0;
TIM_ICInitTypeDef  TIM_ICInitStructure;
// digital humidity and temperature data
uint16_t dht_bit_array[50];
DHT_data DHTValue;
uint8_t		dht_data[5];
uint8_t dht_bit_position = 0;
uint8_t dht_bit_ready = 0;
uint8_t		dht_data_ready = 0;
uint8_t 	dht_rh_str[4], dht_t_str[4];

uint16_t	capture1=0, capture2=0;
volatile uint8_t capture_is_first = 1, capture_is_ready = 0;

uint8_t circulationPumpId;
static uint8_t		LCDLine1[16], LCDLine2[16];		// lcd frame buffer
uint8_t lcd_pointerx=0, lcd_pointery=0;
uint16_t logInterval=0;
RTC_Time toAdjust;
ErrorStatus  HSEStartUpStatus;
FLASH_Status FlashStatus;
int no_sd;
FATFS   fs;       // file system variable to mount SD card
uint16_t VarValue = 0;
uint16_t ph_seven=0;
uint32_t ph0=0;
uint16_t ph4=0;
uint16_t ec1413 = 0, ec0 = 0;
int cdel=0;
uint16_t phBuffer[10];
uint16_t ecBuffer[10];
uint8_t curphstr[5];
uint8_t curecstr[5];
uint16_t phAdcValue;
uint16_t ecAdcValue;
uint8_t currentEc=0;
uint8_t currentPh=0;
uint8_t phUnderOver = 0;	// 0 - pH value is within window, 1 - under window, 2 - over window
uint8_t ecUnderOver = 0;	// 0 - pH value is within window, 1 - under window, 2 - over window
uint16_t phWindowTop, phWindowBottom;
uint16_t ecWindowTop, ecWindowBottom;
uint16_t rhWindowTop, rhWindowBottom;
uint8_t rhUnderOver = 0;
uint32_t lastWriteTime=0;
uint8_t lightSensor;
uint16_t lightRange;
uint32_t timerStateFlags, cTimerStateFlags;
uint8_t wpStateFlags;
uint8_t dosingPumpStateFlags;
uint32_t plugStateFlags;
uint8_t plugSettings[PLUG_AMOUNT] = {0, 1, 2};	// PLUG_AMOUNT - number of plugs HARDCODE
// elementy massiva - nomera tajmerov, sootvetstvujushih Plug'am.
// 0 element - pervyj plug, 1 element - plug no 2, etc
uint16_t button_ranges[8];	// 0,2,4,6 - lower, 1,3,5,7 - higher values for buttons
uint8_t buttonReverse=0;
#ifdef USE_VALVES
uint8_t valve_state;
uint8_t valveFlags;
uint8_t valveMotorStateFlags=0;
#endif
uint8_t waterSensorStateFlags;
uint8_t wsl_buff[3];
uint8_t curculationPumpId;

void hygroStatSettings(void);
uint8_t readPercentVal(uint8_t value);
uint32_t measureDelay(void);
void phMonSettings(void);
void setTimer(uint8_t timerId);
void copy_arr(uint8_t *source, uint8_t *destination, uint8_t amount, uint8_t pos);
void Lcd_write_arr(uc8 *STRING, uint8_t chars);
void Lcd_write_digit(uint8_t numb);
void Delay_us(uint32_t delay);
void buttonCalibration(void);
void Init_pin_out(void);
void Init_pin_in(void);
void Init_lcd(void);
void Lcd_write_data(uint8_t byte);
void Lcd_write_cmd(uint8_t byte);
void Lcd_clear(void);
void Return_home(void);
void Lcd_goto(uc8 x, uc8 y);
void Lcd_write_str(char *STRING);
char* adc2str(uint_fast16_t d, char* out);
void int32str(uint32_t d, char *out);
void AdcInit(void);
uint32_t RTC_GetCounter(void);
void RTC_SetCounter(uint32_t value);
unsigned char RtcInit(void);
uint8_t readButtons(void);
void focusMenuItem(int itemId);
int menuSelector(void);
uint32_t timeAdjust(uint32_t cnt, uint8_t includeDays);
void programRunner(uint8_t programId);
RTC_DateTime unix2DateTime(uint32_t unixtime);
uint32_t DateTime2unix(RTC_DateTime datetime);
void EE_WriteWord(uint16_t Address, uint32_t Data);
uint32_t EE_ReadWord(uint16_t Address);
//void Lcd_print(char *STRING);
void setCTimer(uint8_t timerId);
uint32_t CTimerAdjust(uint32_t time);
void plugStateSet(uint8_t plug, uint8_t state);
void getPh();
FRESULT string2log(char* str, int bytes);
FRESULT sdLog2(void);
uint8_t adjust8bit(uint8_t val);
void loggerSettings(void);
int yesNoSelector(char str, int curval);
void loadSettings(void);
void set4lowBits(uint8_t dta);
void set4highBits(uint8_t dta);
void flush_lcd_buffer(void);
void phStabSettings(void);
void Lcd_write_16int(uint16_t);
void saveButtonRanges(void);
void readButtonRanges(void);
void set16bit(uint16_t value);
void convPh2str(uint8_t ph, char* phstr);
uint8_t readPhVal(uint8_t value);
void dht_conv_data(void);
void dht_init(void);
void dht_init_out(void);
void TIM3_IRQHandler(void);
void TIM1_BRK_TIM15_IRQHandler(void);
void dht_arr_displayer(void);
void setPwmDc(uint8_t duty_cycle);
void setDutyCycle(void);
void displayAdcValues(void);
uint16_t get_average_adc(uint8_t amount);
void EXTI0_IRQHandler(void);
void EXTI1_IRQHandler(void);

void water_program_setup(progId);
void fertilization_setup(void);
void watering_setup(void);
void fertilizer_mixing_program_setup(progId);
void run_watering_program(progId);
void run_fertilizer_mixer(progId);
// void calibratEc(void);
void startWp(void);

static void prvSetupHardware( void );
// static void prvLedBlink( void *pvParameters );
// static void prvLedBlink2( void *pvParameters );
static void displayClock( void *pvParameters );
static void timerStateTrigger(void *pvParameters);
static void plugStateTrigger(void  *pvParameters);
static void sdLog(void  *pvParameters);
static void phMonitor(void  *pvParameters);
static void vTaskLCDdraw(void *pvParameters);
static void watering_program_trigger(void *pvParameters);
// static void valveManager(void);
static void valve_status_updater(void);
void bluetooth_init(void);
void display_usart_rx(void);

void open_valve(uint8_t valveId);
void close_valve(uint8_t valveId, uint8_t forced);
void run_valve_motor(uint8_t valveId);
void stop_valve_motor(uint8_t valveId);
void valve_test(void);
void valve_feedback_init(void);
void dosing_motor_control_init(void);
void valve_motor_control_init(void);
void EXTI15_10_IRQHandler(void);
void water_sensor_input_init(void);
void fertilizer_mixing_program_setup(progId);
uint16_t adjust16bit(uint16_t val);
void enable_dosing_pump(uint8_t pumpId, uint8_t state);
void valveMotorStateSet(uint8_t valveId, uint8_t state);
void USART1_IRQHandler(void);
void StartDMAChannel4(unsigned int LengthBufer);
unsigned char GetStateDMAChannel4(void);
void comm_manager(void);


void comm_manager(void){
	int transferred=0;
	uint16_t buff;
	if (comm_state==COMM_SET_SETTINGS) {
		TxByte = 48;
		while (transferred<SETTINGS_PACKET_SIZE*2) {
			if (RxDataReady==1) {
				if (transferred%2==0) {
					buff=RxByte;
				}
				else {
					buff<<=8;
					buff+=RxByte;
					EE_WriteVariable(SETTINGS_START_ADDR+(transferred/2), buff);
				}
				TxByte = RxByte;
				RxDataReady=0;
				TxDataReady=1;
				vTaskDelay(1);
				transferred++;
			}
			//USART1_IRQHandler();
		}
		comm_state = COMM_MONITOR_MODE;
	}
	if (comm_state==COMM_GET_SETTINGS) {


