plantalog/cadi-gcl/stm32f100/current/main.c
		for (transferred=5; transferred!=0; transferred--) {
			TxByte = transferred;
			TxDataReady=1;
			vTaskDelay(1);
			USART1_IRQHandler();
		}
		transferred=0;
		while (transferred<SETTINGS_PACKET_SIZE*2) {	// *2 bacuse each 16 bit var should be sent in two TX cycles
			if (TxDataReady==0) {
				if (transferred%2==0) {	// if sending odd (or even?) byte
					EE_ReadVariable(SETTINGS_START_ADDR+(transferred/2), &buff);
				}
				vTaskDelay(1);
				TxByte = (buff&0xFF00)>>8;
				buff<<=8;
				TxDataReady=1;
				USART1_IRQHandler();
				transferred++;
			}
			vTaskDelay(1);
		}
		comm_state = COMM_MONITOR_MODE;
	}
	vTaskDelay(1);
	comm_state=comm_state;
}


void USART1_IRQHandler(void)
{

	if (comm_state==48) {

		  if(USART_GetITStatus(BT_USART, USART_IT_RXNE) != RESET)
		  {
			//RxBuffer[RxCounter++] = (USART_ReceiveData(BT_USART) & 0x7F);

			  RxByte=(USART_ReceiveData(BT_USART) & 0x7F);
			  RxDataReady=1;
			  if (RxByte>47 && RxByte<51) {
				  comm_state=RxByte;
			  }
			  USART1->SR &= ~USART_FLAG_RXNE;
			  // TxCounter = 62;
		  }
			  // count xor crc
		  if (TxCounter==62) {
				  log_str[62] = logstr_crc;
		  }
		  logstr_crc ^= log_str[TxCounter];
		  USART1->DR=log_str[TxCounter++];
		  if(TxCounter == 64) {
				USART_ITConfig(BT_USART, USART_IT_RXNE, ENABLE);
				log_str[62] = logstr_crc;
				TxCounter = 0;
				logstr_crc = 0;
		  }
		  USART1->SR &= ~USART_SR_TC;
		  // USART1->SR &= ~USART_FLAG_RXNE;
	}
//	}

	else {

	  if(USART_GetITStatus(BT_USART, USART_IT_RXNE) != RESET)
	  {
		// Read one byte from the receive data register
		RxBuffer[RxCounter++] = (USART_ReceiveData(BT_USART) & 0x7F);
		RxByte = (USART_ReceiveData(BT_USART) & 0x7F);
		RxDataReady=1;
		USART1->SR &= ~USART_FLAG_RXNE;
		  if (comm_state==COMM_MONITOR_MODE && RxByte>47 && RxByte<51) {
			  comm_state=RxByte;
		  }
	  }

	  if(TxDataReady==1){
		  USART1->DR = TxByte;
		  TxDataReady=0;
	  }
	  USART1->SR &= ~USART_SR_TC;
	}
}




void DMA1_Channel4_IRQHandler (void)
{
  if(DMA1->ISR & DMA_ISR_TCIF4) { }  
//  if(DMA1->ISR & DMA_ISR_HTIF4) { }      //


//  if(DMA1->ISR & DMA_ISR_TEIF4) { }      
}

void DMA1_Channel5_IRQHandler (void)
{

 if(DMA1->ISR & DMA_ISR_TCIF5) { }
// if(DMA1->ISR & DMA_ISR_HTIF5) { }
// if(DMA1->ISR & DMA_ISR_TEIF5) { }
}

#ifdef KOSTYLI_MODE
void bluetooth_init(void){
	NVIC_InitTypeDef NVIC_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;


    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO, ENABLE);

    // Tx on PA9 as alternate function push-pull
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

  /* Rx on PA10 as input floating */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);


  USART_InitTypeDef USART_InitStructure;

  // USART 1 init
  USART_DeInit(USART1);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

  USART_InitStructure.USART_BaudRate = 9600;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART_Init(USART1, &USART_InitStructure);

  USART_ClearFlag(USART1, USART_FLAG_CTS | USART_FLAG_LBD  |
                        USART_FLAG_TC  | USART_FLAG_RXNE
                );

  USART_Cmd(USART1, ENABLE);

}

#endif

#ifndef KOSTYLI_MODE
void bluetooth_init(void){
	NVIC_InitTypeDef NVIC_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_AFIO, ENABLE);

    NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
//    NVIC_Init(&NVIC_InitStructure);

    // Tx on PA9 as alternate function push-pull
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

  /* Rx on PA10 as input floating */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

/*
    // DMA USART1 setup
    DMA_InitTypeDef DMA_InitStructure;

    // USARTy_Tx_DMA_Channel (triggered by USARTy Tx event) Config
    DMA_DeInit(USARTy_Tx_DMA_Channel);
    DMA_InitStructure.DMA_PeripheralBaseAddr = USARTy_DR_Base;
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)TxBuffer1;
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
    DMA_InitStructure.DMA_BufferSize = TxBufferSize1;
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(USARTy_Tx_DMA_Channel, &DMA_InitStructure);
*/



  USART_InitTypeDef USART_InitStructure;

  // USART 1 init
  USART_DeInit(USART1);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

  USART_InitStructure.USART_BaudRate = 9600;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART_Init(USART1, &USART_InitStructure);

  USART_ClearFlag(USART1, USART_FLAG_CTS | USART_FLAG_LBD  |
                        USART_FLAG_TC  | USART_FLAG_RXNE
                );
  USART1->CR1  |= USART_CR1_RXNEIE;
  USART1->CR1  |= USART_CR1_TCIE;
  USART_Cmd(USART1, ENABLE);
  NVIC_EnableIRQ(USART1_IRQn);     
/*
  
  if ((RCC->AHBENR & RCC_AHBENR_DMA1EN) != RCC_AHBENR_DMA1EN)
  RCC->AHBENR |= RCC_AHBENR_DMA1EN;
  // set source and target addresses and data amount to be transferred
  DMA1_Channel4->CPAR  =  (uint32_t)&USART1->DR;   // USART data adress
  DMA1_Channel4->CMAR  =  (uint32_t)&log_str[0];   // memory address
  DMA1_Channel4->CNDTR =  64;                      // data amount

