plantalog/cadi-gcl/stm32f100/current/main.c
  DMA1_Channel4->CCR   =  0;                       //reset config register
  DMA1_Channel4->CCR   = ~DMA_CCR4_CIRC;           //disable cyclic mode
  DMA1_Channel4->CCR  |=  DMA_CCR4_DIR;            //direction: read FROM memory
  
  DMA1_Channel4->CCR   = ~DMA_CCR4_PSIZE;          //data size 8 bit
  DMA1_Channel4->CCR   = ~DMA_CCR4_PINC;           //do not use increment of pointer
  
  DMA1_Channel4->CCR   = ~DMA_CCR4_MSIZE;          //data size 8 bit
  DMA1_Channel4->CCR  |=  DMA_CCR4_MINC;           //use pointer increment
  USART1->CR3 |= USART_CR3_DMAT;                    //enable transfer USART1 through DMA */
//  USART1->CR3 |= USART_CR3_DMAR;                    //enable receiving USART1 via DMA

/*  // Enable USARTy DMA TX Channel
  DMA_Cmd(USARTy_Tx_DMA_Channel, ENABLE);

  // Enable USARTz DMA TX Channel
  DMA_Cmd(USARTz_Tx_DMA_Channel, ENABLE); */

}

#endif

unsigned char GetStateDMAChannel4(void)
{
  if(DMA1->ISR & DMA_ISR_TCIF4) return 1;   //transmission finished
  return 0;                                 //transmission in prograss
}
//********************************************************************************
//Function: start exchange in  direction "memory-DMA-USART1"                           //
//Argument: amount of data                                        //
//********************************************************************************
void StartDMAChannel4(unsigned int LengthBufer)
{
  DMA1_Channel4->CCR   = ~DMA_CCR4_EN;      //disable DMA channel
  DMA1_Channel4->CNDTR =  LengthBufer;      //load data amount to transmit
  DMA1->IFCR          |=  DMA_IFCR_CTCIF4;  //reset end of transmit flag
  DMA1_Channel4->CCR  |=  DMA_CCR4_EN;      //enable DMA channel
}


void valve_motor_control_init(void){		// init PA8-PA11 for valve motor control output
		 GPIOA->CRH      &= ~GPIO_CRH_CNF8;
	     GPIOA->CRH   |= GPIO_CRH_MODE8_0;
		 GPIOA->CRH      &= ~GPIO_CRH_CNF9;
	     GPIOA->CRH   |= GPIO_CRH_MODE9_0;
		 GPIOA->CRH      &= ~GPIO_CRH_CNF10;
	     GPIOA->CRH   |= GPIO_CRH_MODE10_0;
		 GPIOA->CRH      &= ~GPIO_CRH_CNF11;
	     GPIOA->CRH   |= GPIO_CRH_MODE11_0;
}

void valve_feedback_init(void){		// init PC10-PC12 as input for 3V valve feedback
	GPIO_InitTypeDef GPIO_InitStructure;
	EXTI_InitTypeDef EXTI_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

	  /* Enable GPIOB clock */
	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);

	  /* Configure PC.10-12 pin as input pull-down */
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11 | GPIO_Pin_12;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
	  GPIO_Init(VALVE_SENSOR_PORT, &GPIO_InitStructure);

	  /* Enable AFIO clock */
//	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
	  /* Connect EXTI10 Line to PC10 pin */
	  GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, GPIO_PinSource10);

	  /* Configure EXTI10 line */
	  EXTI_InitStructure.EXTI_Line = EXTI_Line10;
	  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
	  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	  EXTI_Init(&EXTI_InitStructure);

	  // Configure EXTI11 line

	  GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, GPIO_PinSource11);
	  EXTI_InitStructure.EXTI_Line = EXTI_Line11;
	  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
	  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	  EXTI_Init(&EXTI_InitStructure);

	  // Configure EXTI12 line

	  GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, GPIO_PinSource12);
	  EXTI_InitStructure.EXTI_Line = EXTI_Line12;
	  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
	  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	  EXTI_Init(&EXTI_InitStructure);

	  // Enable and set EXTI15_10 Interrupt to the lowest priority
	  NVIC_InitStructure.NVIC_IRQChannel = EXTI15_10_IRQn;
	  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
	  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
	  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

	  NVIC_Init(&NVIC_InitStructure);
}


void water_sensor_input_init(void){		// init PC15, PD0, PD1 as water sensor inputs
		GPIO_InitTypeDef GPIO_InitStructure;
		EXTI_InitTypeDef EXTI_InitStructure;
		NVIC_InitTypeDef NVIC_InitStructure;

		  // Enable GPIO clock
		  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

		  // Configure PB0-2 pins as input pull-down
		  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;
		  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
		  GPIO_Init(GPIOB, &GPIO_InitStructure);


// interrupt config for water level sensor inputs

		  GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource0);
		  EXTI_InitStructure.EXTI_Line = EXTI_Line0;
		  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
		  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
		  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
		  EXTI_Init(&EXTI_InitStructure);

		  GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource1);
		  EXTI_InitStructure.EXTI_Line = EXTI_Line1;
		  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
		  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
		  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
		  EXTI_Init(&EXTI_InitStructure);

		  GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource2);
		  EXTI_InitStructure.EXTI_Line = EXTI_Line2;
		  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
		  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
		  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
		  EXTI_Init(&EXTI_InitStructure);

		  NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
		  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		  NVIC_Init(&NVIC_InitStructure);

