plantalog/cadi-gcl/stm32f100/current/main.c
		  NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;
		  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		  NVIC_Init(&NVIC_InitStructure);

		  NVIC_InitStructure.NVIC_IRQChannel = EXTI2_IRQn;
		  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
		  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		  NVIC_Init(&NVIC_InitStructure);
}

void dosing_motor_control_init(void){	// init PC6-PC9 as PWM output for dosing pump control
	  GPIO_InitTypeDef GPIO_InitStructure;
	  TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStruct;
	  TIM_OCInitTypeDef TIM_OCInitStruct;

//	  volatile int i;
//	  int n = 1;
//	    int brightness = 0;

	    RCC_APB2PeriphClockCmd(
	            RCC_APB2Periph_GPIOC |
	            RCC_APB2Periph_AFIO, ENABLE );

	    RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM3, ENABLE );

	    GPIO_StructInit(&GPIO_InitStructure); // Reset init structure

	    // Setup Blue & Green LED on STM32-Discovery Board to use PWM.
	    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9;
	    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;            // Alt Function - Push Pull
	    GPIO_Init( GPIOC, &GPIO_InitStructure );
	    GPIO_PinRemapConfig( GPIO_FullRemap_TIM3, ENABLE );        // Map TIM3_CH3 to GPIOC.Pin8, TIM3_CH4 to GPIOC.Pin9

	    // Let PWM frequency equal 100Hz.
	    // Let period equal 1000. Therefore, timer runs from zero to 1000. Gives 0.1Hz resolution.
	    // Solving for prescaler gives 240.
	    TIM_TimeBaseStructInit( &TIM_TimeBaseInitStruct );
	    TIM_TimeBaseInitStruct.TIM_ClockDivision = TIM_CKD_DIV4;
	    TIM_TimeBaseInitStruct.TIM_Period = 1000 - 1;   // 0..999
	    TIM_TimeBaseInitStruct.TIM_Prescaler = 240 - 1; // Div 240
	    TIM_TimeBaseInit( TIM3, &TIM_TimeBaseInitStruct );

	    TIM_OCStructInit( &TIM_OCInitStruct );
	    TIM_OCInitStruct.TIM_OutputState = TIM_OutputState_Enable;
	    TIM_OCInitStruct.TIM_OCMode = TIM_OCMode_PWM1;
	    // Initial duty cycle equals 0%. Value can range from zero to 1000.
	    TIM_OCInitStruct.TIM_Pulse = 0; // 0 .. 1000 (0=Always Off, 1000=Always On)


	    TIM_OC1Init( TIM3, &TIM_OCInitStruct ); // Channel 3 Blue LED
	    TIM_OC2Init( TIM3, &TIM_OCInitStruct ); // Channel 3 Blue LED
	    TIM_OC3Init( TIM3, &TIM_OCInitStruct ); // Channel 3 Blue LED
	    TIM_OC4Init( TIM3, &TIM_OCInitStruct ); // Channel 4 Green LED

	    TIM_Cmd( TIM3, ENABLE );
}

/*
uint8_t get_wsl(uint8_t wsId){
	uint8_t i=0, tmp=0;
	for (i=0; i<8; i++){
		tmp = tmp + (wsl_buff[wsId]>>i)&1;
	}
	if (wsl_buff[wsId]>8) {
		return 1;
	}
	else {
		return 0;
	}
}
*/

void waterSensorStateTrigger(void){
	uint8_t i=0;
	for (i=0; i<2; i++) {
		wsl_buff[i]=wsl_buff[i]<<1;
		wsl_buff[i] = wsl_buff[i] + (((GPIOB->IDR)>>i)&1);

		if (wsl_buff[i]>8) {
			waterSensorStateFlags |= (1<<i);	// set flag
		}
		else {
			waterSensorStateFlags &= ~(1<<i);	//reset flag
		}
	}
}

void open_valve(uint8_t valveId){
	vTaskDelay(1);
#ifdef USE_VALVES
	uint8_t curstatus=0;
	curstatus=valve_state&(1<<valveId);	// check if valve flag active now
	curstatus>>=valveId;	// ostavit' toka flag
	if (curstatus==0) {
		valveMotorStateSet(valveId, 1);
		while (curstatus==0) {
//		while ((((VALVE_SENSOR_PORT->IDR)>>VALVE_SENSOR_GPIO_SHIFT+valveId) & 1)==0) {
//			curstatus=0;
			curstatus=valve_state&(1<<valveId);	// check if timer active now
			curstatus>>=valveId;	// ostavit' toka flag
			vTaskDelay(10);
		}
		valveMotorStateSet(valveId, 0);
	}
	valveFlags |= (1<<valveId);
	vTaskDelay(5);
#endif
}

void close_valve(uint8_t valveId, uint8_t forced){
	vTaskDelay(5);
#ifdef USE_VALVES
	uint8_t curstatus=1;
	curstatus=valve_state&(1<<valveId);	// check if valve open now
	curstatus>>=valveId;	// ostavit' toka flag
	if (forced==1) {
		curstatus=1;
	}
	if (curstatus==1) {

		valveMotorStateSet(valveId, 1);
		valveMotorStateSet(valveId, curstatus);
//		run_valve_motor(valveId);
//		while (curstatus==1) {
		while (curstatus==1) {
			vTaskDelay(5);
//			curstatus=1;
			curstatus=valve_state&(1<<valveId);	// check if valve open now
			curstatus>>=valveId;	// ostavit' toka flag
		}
		valveMotorStateSet(valveId, 0);
		valveMotorStateSet(valveId, curstatus);
	}
	valveFlags &= ~(1<<valveId); // sbrosit' flag
	vTaskDelay(5);
#endif
}

/*void valveManager(void){	// tracks the valve flags and adjusts valves accordingly
	uint8_t i, curstate=0;
	while (1) {
		for (i=0; i<(VALVE_AMOUNT); i++) {
			curstate=valve_state&(1<<i);	// check if valve open now
			curstate>>=i;	// ostavit' toka flag
			if (((valveFlags>>i)&1) && curstate==0){
				open_valve(i);
			}
			if (!((valveFlags>>i)&1) && curstate == 1){
				close_valve(i,0);
			}
			vTaskDelay(1);
		}
		vTaskDelay(2);
	}
} */

void valve_status_updater(void){
#ifdef USE_VALVES
	uint8_t i=0;

		for (i=0; i<(VALVE_AMOUNT); i++) {
			vTaskDelay(5);
			if (((VALVE_SENSOR_PORT->IDR)>>VALVE_SENSOR_GPIO_SHIFT+i) & 1) {
				valve_state |= (1<<i);	// set flag
			}
			else {
				valve_state &= ~(1<<i);	//reset flag
			}
		}
		vTaskDelay(10);


#endif
}

void run_valve_motor(uint8_t valveId){

//	void setPwmDc(uint8_t duty_cycle){		// duty_cycle in %
//	TIM3->CCR3 = duty_cycle*10;
//	TIM3->CCR4 = 1000 - duty_cycle*10;
	VALVE_MOTOR_PORT->BRR |= (1<<valveId+VALVE_MOTOR_GPIO_SHIFT);
//	}
//	setPwmDc(0);
//	VALVE_MOTOR_PORT->BSRR |= (1<<valveId);
//	GPIOC->BSRR= GPIO_BSRR_BS9;
}

void stop_valve_motor(uint8_t valveId){
//	setPwmDc(100);
	VALVE_MOTOR_PORT->BSRR |= (1<<valveId+VALVE_MOTOR_GPIO_SHIFT);
}

void EXTI9_5_IRQHandler(void)
{
//  if(EXTI_GetITStatus(EXTI_Line10) != RESET)
//  {
    /* Toggle LED2 */
//     STM_EVAL_LEDToggle(LED2);

    /* Clear the  EXTI line 9 pending bit */
	EXTI_ClearITPendingBit(EXTI_Line5);
	EXTI_ClearITPendingBit(EXTI_Line6);
    EXTI_ClearITPendingBit(EXTI_Line7);
//    valve_status_updater();
//  }
}


void EXTI0_IRQHandler(void) {
	EXTI_ClearITPendingBit(EXTI_Line0);

