plantalog/cadi-gcl/stm32f100/current/main.c
}

void EXTI1_IRQHandler(void) {
	EXTI_ClearITPendingBit(EXTI_Line1);

}

void EXTI2_IRQHandler(void) {
	EXTI_ClearITPendingBit(EXTI_Line2);

}

void EXTI15_10_IRQHandler(void)
{
    // Clear the  EXTI line 10-12 pending bit
	EXTI_ClearITPendingBit(EXTI_Line10);
	EXTI_ClearITPendingBit(EXTI_Line11);
	EXTI_ClearITPendingBit(EXTI_Line12);
//    valve_status_updater();
}


void valve_test(void){
	uint8_t button=0, curState=0, i=0;
	Lcd_clear();
#ifdef USE_VALVES
	Lcd_write_str("Open/close valve");
#endif
	while (button!=BUTTON_OK) {
		vTaskDelay(20);
		button=readButtons();
#ifdef USE_VALVES
		for (i=0; i<3; i++) {
			curState = valve_state&(1<<i);	// check if water level reached top sensor
			curState>>=i;	// ostavit' toka flag

			if (i==0 && button==BUTTON_FWD){
					if (curState==1){
						valveFlags=0;
					}
					else {
						valveFlags=1;
					}
			}
			if (i==1 && button==BUTTON_BCK){
				if (curState==1){
					valveFlags=2;
				}
				else {
					valveFlags=3;
				}
			}
		}

		Lcd_goto(1,0);
		Lcd_write_digit(valve_state);
		Lcd_write_str("VS");
		uint16_t val=0;
		val = VALVE_SENSOR_PORT->IDR>>10;
		Lcd_write_digit(val/10000);
		Lcd_write_digit(val/100);
		Lcd_write_digit(val);
		Lcd_write_str(" ");
		if (VALVE_SENSOR_PORT->IDR>>10 & 1) {
			Lcd_write_str("1");
		}
		else {
			Lcd_write_str("0");
		}
#endif

		Lcd_write_str("W");

//		Lcd_write_digit(wsl_buff[0]/100);
//		Lcd_write_digit(wsl_buff[0]);
//		Lcd_write_digit(waterSensorStateFlags);
//		Lcd_write_digit(GPIOB->IDR/100);
//		Lcd_write_digit(GPIOB->IDR);

	}
	Lcd_clear();
}

void water_program_setup(progId){
	uint16_t addr=0, tempvalue=0;
	uint32_t tmp32, interval;

	// choose tank top water level sensor
	addr = WP_OFFSET+progId*WP_SIZE+TOP_WATER_SENSOR_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Set top sensor");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);


	// choose tank bottom water level sensor
	addr = WP_OFFSET+progId*WP_SIZE+BOTTOM_WATER_SENSOR_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Set bottom sensor");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set fresh water fill timeout, seconds
	addr = WP_OFFSET+progId*WP_SIZE+WATER_FILL_TIMEOUT_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Wtr fill timeout");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set circulation pump plug id
//	addr = WP_OFFSET+progId*WP_SIZE+WP_CIRCULATION_PUMP_PLUG_SHIFT;
	EE_ReadVariable(CIRCULATION_PUMP_ID_ADDR, &tempvalue);
	Lcd_clear();
	Lcd_write_str("CircPump plug ID");
	tempvalue = adjust8bit(tempvalue);
	EE_WriteVariable(CIRCULATION_PUMP_ID_ADDR, tempvalue);
	circulationPumpId = tempvalue;
	addr = EE_PLUG_SETTINGS+tempvalue;
	EE_WriteVariable(addr, 70);		// HARDCODE!!! program (timer) id for circulation pump
	plugSettings[tempvalue] = 70;

	// set watering pump plug id
	addr = WP_OFFSET+progId*WP_SIZE+WP_WATERING_PUMP_PLUG_ID;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Wtrng pump plug");
	tempvalue = adjust8bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);
	addr = EE_PLUG_SETTINGS+tempvalue;
	EE_WriteVariable(addr, 71);		// HARDCODE!!! program (timer) id for watering pump
	plugSettings[tempvalue] = 71;

	// set watering duration, seconds
	addr = WP_OFFSET+progId*WP_SIZE+WP_DURATION_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Wtrng duration");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set watering duration, seconds
	addr = WP_OFFSET+progId*WP_SIZE+WP_INTERVAL_SHIFT;
	interval = EE_ReadWord(addr);
	Lcd_clear();
	Lcd_write_str("Set run interval");
	vTaskDelay(500);
	interval = CTimerAdjust(interval);
	EE_WriteWord(addr, interval);

	addr = WP_OFFSET+progId*WP_SIZE+WP_DRAIN_DURATION_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Drain duration");
	vTaskDelay(500);
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// enable watering program (=1 enables the WP)
	addr = WP_OFFSET+progId*WP_SIZE+WP_ENABLE_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Enable WP?");
	tempvalue = adjust8bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);



//	EE_ReadWord(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Start program?");
	uint8_t button=0;
	while (button==0) {
		button=readButtons();
		vTaskDelay(10);
	}
	if (button==BUTTON_OK) {
		// set initial time point of watering program
		addr = WP_OFFSET+progId*WP_SIZE+WP_START_TIME_SHIFT;
		tmp32 = RTC_GetCounter();
		EE_WriteWord(addr, tmp32);

		addr = WP_OFFSET+progId*WP_SIZE+WP_LAST_RUN_SHIFT;
		EE_WriteWord(addr, (RTC_GetCounter()-interval+5));
//			run_watering_program(progId);
	}
	if (button==BUTTON_CNL) {
		Lcd_clear();
		Lcd_write_str("Start time");
		vTaskDelay(1000);
		addr = WP_OFFSET+progId*WP_SIZE+WP_START_TIME_SHIFT;
		tmp32 = EE_ReadWord(addr);
		tmp32 = timeAdjust(tmp32, 1);
		EE_WriteWord(addr, tmp32);
	}
	Lcd_clear();
	Lcd_write_str("End time");
	vTaskDelay(1000);
	addr = WP_OFFSET+progId*WP_SIZE+WP_END_TIME_SHIFT;
	tmp32 = EE_ReadWord(addr);
	tmp32 = timeAdjust(tmp32, 1);
	EE_WriteWord(addr, tmp32);
	Lcd_clear();
	vTaskDelay(200);

	vTaskSuspendAll();
	loadSettings();
	xTaskResumeAll();
}

void fertilization_setup(void){
	uint8_t progId=0;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	fertilizer_mixing_program_setup(progId);
}

void watering_setup(void){
	uint8_t progId=0;
	Lcd_clear();
	Lcd_write_str("Program nr");
	vTaskDelay(200);
	progId = adjust8bit(progId);
	water_program_setup(progId);
}

// set fertilizer mixing programs
void fertilizer_mixing_program_setup(progId){
	uint16_t addr=0, tempvalue=0;

	// choose dosing pump to use
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_PUMP_ID_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Fertilizer 2 use");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set dosing time, seconds
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_DOSING_TIME_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Dosing duration");
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

	// set circulation pump mixing time
	addr = FMP_OFFSET+progId*FMP_SIZE+FMP_CIRCULATION_MIXING_TIME_SHIFT;
	EE_ReadVariable(addr, &tempvalue);
	Lcd_clear();
	Lcd_write_str("Aftermix time");		// setting the time for running circulation pump to mix the fertilizer into solution
	tempvalue = adjust16bit(tempvalue);
	EE_WriteVariable(addr, tempvalue);

