plantalog/cadi-gcl/stm32f100/current/main.c
		}
		vTaskDelay(1);
#ifdef USE_VALVES
		uint8_t valveId=0, valveMotorStateFlag=0;
		for (valveId=0; valveId<3; valveId++) {
			valveMotorStateFlag=valveMotorStateFlags&(1<<valveId);	// check if timer active now
			valveMotorStateFlag>>=valveId;	// ostavit' toka flag
			if (valveMotorStateFlag==1) {
				valveMotorStateSet(valveId,1);
			}
			else {
				valveMotorStateSet(valveId,2);
			}
		}
#endif
//		vTaskDelay(1);
//		valveManager();
		vTaskDelay(1);
	}
}

void plugStateSet(uint8_t plug, uint8_t state){
//	if (PLUG_INVERT==1) {
//		state ^= (1<<0);
//	}
	if (state==1) {
		PLUG_DISABLE = (1<<plug);
		plugStateFlags |= (1<<plug);
	}
	else {
		PLUG_ENABLE = (1<<plug);
		plugStateFlags &= ~(1<<plug);
	}
}

void valveMotorStateSet(uint8_t valveId, uint8_t state){
#ifdef USE_VALVES
	if (state==1) {
//		VALVE_MOTOR_PORT->BRR |= (1<<valveId+VALVE_MOTOR_GPIO_SHIFT); // valve enable 146%
			valveMotorStateFlags |= (1<<valveId);
			VALVE_ENABLE = (1<<valveId+VALVE_MOTOR_GPIO_SHIFT);
		}
		else {
			valveMotorStateFlags &= ~(1<<valveId);
			VALVE_DISABLE = (1<<valveId+VALVE_MOTOR_GPIO_SHIFT);
		}
#endif
}



void lightSensorTriger() {
//	int lightSensorLevel;
//	lightSensorLevel=ADC1->JDR3;
	if (ADC1->JDR3 > lightRange) {
		lightSensor=DAY;
	}
	else {
		lightSensor=NIGHT;
	}
}

/* void lightRangeSet(){
	uint16_t definedLightRange, Address;
	uint_fast16_t curLevel;
//	char bfr[4];
	uint8_t button=0;
	Lcd_clear();
	Lcd_goto(0, 1);
	Lcd_write_str("Push OK to set");
	Address=LIGHT_RANGE_ADDR;
	EE_ReadVariable(Address, &definedLightRange);
//	vTaskDelay(10);
	while (button!=BUTTON_OK){
		vTaskDelay(100);
		Lcd_goto(1, 3);
		curLevel=JDR_PH;
		vTaskDelay(10);

		// po dva razrjada mozhno printovat' chto ugodno :)
		Lcd_write_digit(curLevel);
		Lcd_goto(1,1);
		curLevel /= 100;	// sledujushie dva razrjada
		vTaskDelay(10);
		Lcd_write_digit(curLevel);
		vTaskDelay(10);
		button=readButtons();
	}
	EE_WriteVariable(Address, curLevel);
	Lcd_clear();
} */

/* void ls2ct(uint8_t timerId) {	// Setting Light sensor plus 2 cyclic timers
	uint16_t Address, timerData;
	uint8_t button, dayTimerId, sec, min, hour;
	uint32_t dayDurationUnix, dayIntervalUnix;
//	RTC_Time ctime;
	Lcd_clear();
	Lcd_goto(0,0);
	Lcd_write_str("Light sensor and");
	Lcd_goto(1,0);
	Lcd_write_str("2 cyclic timers");
	vTaskDelay(1500);
	Lcd_clear();

	Address = LS2CT_ADDR+timerId;
	EE_ReadVariable(Address, &timerData);
	dayTimerId=timerData;
//	nightTimerId=timerData<<8;
	Lcd_goto(0,0);
	vTaskDelay(25);
	Lcd_write_str("Day timer");
	vTaskDelay(25);
	while (button!=BUTTON_OK) {
		Lcd_goto(1,0);
		Address = EE_CTIMER_DURATION+dayTimerId*EE_CTIMER_SIZE;
		dayDurationUnix=EE_ReadWord(Address);
		vTaskDelay(25);
		sec = dayDurationUnix % 60;
		dayDurationUnix /= 60;
		min = dayDurationUnix % 60;
		hour = dayDurationUnix/3600;
		Lcd_write_digit(hour);
		Lcd_write_str(":");
		Lcd_write_digit(min);
		Lcd_write_str(":");
		Lcd_write_digit(sec);
		vTaskDelay(25);
		Address = EE_CTIMER_INTERVAL+dayTimerId*EE_CTIMER_SIZE;
		dayIntervalUnix=EE_ReadWord(Address);
		vTaskDelay(25);
		sec = dayIntervalUnix % 60;
		dayIntervalUnix /= 60;
		min = dayIntervalUnix % 60;
		hour = dayIntervalUnix/3600;
		Lcd_goto(1,8);
		Lcd_write_digit(hour);
		Lcd_write_str(":");
		Lcd_write_digit(min);
		Lcd_write_str(":");
		Lcd_write_digit(sec);
		vTaskDelay(25);
		button=readButtons();
		vTaskDelay(25);
		if (button==BUTTON_BCK) {
			dayTimerId--;
		}
		if (button==BUTTON_FWD) {
			dayTimerId++;
		}
	}
	Lcd_clear();
}

*/

void EE_WriteWord(uint16_t Address, uint32_t Data){
	uint16_t tmp, tmp2;
	tmp2 = Data & 0xFFFF;
	tmp = Data >> 16;
	EE_WriteVariable(Address+1, tmp2);
	EE_WriteVariable(Address, tmp);
}

void programRunner(uint8_t programId){

	uint32_t tmp;
	switch (programId) {
	case 1:
		break;
	case 2:
	    setTimer(0);
		break;
	case 3:
		setTimer(1);
		break;
	case 4:
		setTimer(2);
		break;
	case 5:
		tmp = RTC_GetCounter();
		uint32_t unixtime = timeAdjust(tmp, 1);
		RTC_SetCounter(unixtime);
		Lcd_clear();
		break;
	case 6:
	    setCTimer(0);
		break;
	case 7:
		setCTimer(1);
		break;
	case 8:
		setCTimer(2);
		break;
	case 9:
		setPlug(0);
		break;
	case 10:
		setPlug(1);
		break;
	case 11:
		setPlug(2);
		break;
	case 13:
		phMonSettings();
		break;
	case 14:
//		lightRangeSet();
		break;
	case 15:
		calibratePh();
		break;
	case 16:
		phStabSettings();
		break;
	case 17:
		dht_arr_displayer();
#ifdef	TEST_MODE
		displayAdcValues();	// test function to display ADC values
#endif
		display_usart_rx();
//		setDutyCycle();
		break;
	case 18:
		hygroStatSettings();
		break;
	case 19:
//		thermoStatSetup();
		break;
	case 20:
		valve_test();
		break;
	case 21:
		watering_setup();
		break;
	case 22:
		fertilization_setup();
		break;
	case 23:
		calibrateEc();
		break;
	case 24:
		// ecStabSettings();
		break;
	case 25:
		// buttonTest();
		break;
	case 26:
		// phAndEcTest();
		break;
	case 27:
		startWp();
		break;
	}
}

/* void phStabSettings(void){
	Lcd_clear();
	Lcd_write_str("Set top lvl");
	readPhVal(value);
	EE_WriteVariable(SD_LOG_INTERVAL, logSetting);
	Lcd_write_str("Set bottom lvl");
	readPhVal(value);
	EE_WriteVariable(SD_LOG_INTERVAL, logSetting);

} */

void loggerSettings(void){
	uint32_t logSetting;
//	char value[8];
	vTaskDelay(10);
	Lcd_clear();
	EE_ReadVariable(SD_LOG_INTERVAL, &logSetting);
	vTaskDelay(100);
	Lcd_goto(0,0);
	Lcd_write_str("Log frequency");
	vTaskDelay(3000);
	logSetting=adjust8bit(logSetting);	// poluchit' novoe znachenie ot user'a
	EE_WriteVariable(SD_LOG_INTERVAL, logSetting);
	vTaskDelay(50);
	Lcd_clear();
	Lcd_goto(0,2);
	Lcd_write_str("Complete!");
	vTaskDelay(500);
	loadSettings();
	Lcd_clear();
}

void phMonSettings(void) {
//	uint16_t Address;
	uint32_t phSetting;	// possibly 16 bit?
//	char value[8];
	vTaskDelay(10);
	Lcd_clear();
	EE_ReadVariable(PH_INTERVAL, &phSetting);
	vTaskDelay(100);
	Lcd_goto(0,0);
	Lcd_write_str("Probing interval");
	vTaskDelay(1000);
	phSetting=adjust8bit(phSetting);	// poluchit' novoe znachenie ot user'a
	EE_WriteVariable(PH_INTERVAL, phSetting);
	vTaskDelay(50);


	// analogichno dlja buffer size
	EE_ReadVariable(PH_BUFF_SIZE, &phSetting);
	Lcd_clear();
	Lcd_goto(0,2);
	Lcd_write_str("Buffer size");
	vTaskDelay(500);
	phSetting=adjust8bit(phSetting);	// poluchit' novoe znachenie ot user'a
	EE_WriteVariable(PH_BUFF_SIZE, phSetting);
	Lcd_clear();
	Lcd_goto(0,2);
	Lcd_write_str("Complete!");
	vTaskDelay(500);
	loadSettings();
	Lcd_clear();
}

uint8_t adjust8bit(uint8_t val){
	uint8_t button;
	if (val>99) {val=99;}
	while (button!=BUTTON_OK) {
		button=readButtons();
		vTaskDelay(25);
		if (button==BUTTON_BCK) {
			if (val<1) {
				val=99;
			}
			else {
				val--;
			}
		}
		if (button==BUTTON_FWD) {
			if (val>98) {
				val=0;
			}
			else {
				val++;
			}
		}
		Lcd_goto(1,0);
		Lcd_write_str("numero <");
		Lcd_write_digit(val);
		Lcd_write_str(">");
		vTaskDelay(25);
	}
	Lcd_clear();
	Lcd_write_str("OK");
	vTaskDelay(200);
	return val;
}

uint16_t adjust16bit(uint16_t val){
	uint8_t button;
	if (val>65534) {
		val=0;
	}
	while (button!=BUTTON_OK) {
		button=readButtons();
		vTaskDelay(25);
		if (button==BUTTON_BCK) {
			if (val<1) {
				val=65535;
			}
			else {
				val--;
			}
		}
		if (button==BUTTON_FWD) {
			if (val>65534) {

				val=0;
			}
			else {
				val++;
			}
		}
		Lcd_goto(1,0);
		Lcd_write_str("numero <");
		Lcd_write_digit(val/10000);
		Lcd_write_digit(val/100);
		Lcd_write_digit(val);
		Lcd_write_str(">");
		vTaskDelay(25);
	}
	Lcd_clear();
	Lcd_write_str("OK");
	vTaskDelay(200);
	return val;
}

