plantalog/cadi-gcl/stm32f100/current/main.c
#ifdef KOSTYLI_MODE
 	          			USART1->SR &= ~USART_SR_TC;
 	          			if (log_inc==64){
 	          			    log_inc=0;
 	          			    USART1->DR=13;
 	          			}
 	          			else {
 	          				USART1->DR=log_str[log_inc++];
 	          			}
 //	          		}
#endif
 	          vTaskDelay(2);

 		}
 		phBuffer[9] = JDR_PH;
 		ecBuffer[9] = JDR_EC;
 		vTaskDelay(1);
		waterSensorStateTrigger();
		vTaskDelay(1);
		valve_status_updater();
		vTaskDelay(1);
  //  	comm_manager();
//		vTaskDelay(1);
 	}
}

void copy_arr(uint8_t *source, uint8_t *destination, uint8_t amount, uint8_t pos){
	int i=0;
	for (i=0; i<amount;i++) {
		destination[i+pos] = source[i];
	}
}


void displayClock(void *pvParameters)
{
		RTC_DateTime	DateTime;
		uint32_t tmp;
		uint8_t button;
//		char str[6];
		Lcd_clear();
    	while (1)
	    {


//    		if (GetStateDMAChannel4()==1){
//    			StartDMAChannel4(64);
//    		}

	    	vTaskDelay(10);
	    	setPwmDc(20);
    		tmp = RTC_GetCounter();
    		DateTime=unix2DateTime(tmp);
	    	LCDLine1[0]= (DateTime.day / 10) + 48;
	    	LCDLine1[1]= (DateTime.day % 10) + 48;
	    	LCDLine1[2]= 45;
	    	LCDLine1[3]= (DateTime.month / 10) + 48;
	    	LCDLine1[4]= (DateTime.month % 10) + 48;
	    	LCDLine1[5]= 45;
	    	LCDLine1[6]= (DateTime.year / 10) + 48;
	    	LCDLine1[7]= (DateTime.year % 10) + 48;
	    	LCDLine2[6]= 32;
	    	LCDLine2[7]= 32;


	    	Lcd_goto(1,0);
	    	Lcd_write_digit(DateTime.hour);
	    	Lcd_write_digit(DateTime.min);
	    	Lcd_write_digit(DateTime.sec);

	    	vTaskDelay(5);

	    	Lcd_goto(1,9);
	    	Lcd_write_str("pH:");
	    	vTaskDelay(5);
	    	getPh();
			copy_arr(&curphstr, LCDLine2, 4, 12);
	    	vTaskDelay(5);
	    	Lcd_goto(0,9);
#ifdef	TEST_MODE
	    	Lcd_write_str("EC:");
	    	vTaskDelay(5);
	    	getEc();
	    	vTaskDelay(9);
			copy_arr(&curecstr, LCDLine1, 4, 12);
#endif
			setPwmDc(90);
#ifndef	TEST_MODE
	    	uint16_t flg;
	    	// vyvod flagov dozirujushih nasosov
	    	uint8_t i;
	    	for (i=0; i<3; i++) {
	    		flg=timerStateFlags&(1<<i);

//	    		flg=wpStateFlags&(1<<i);
//	    		flg=dosingPumpStateFlags&(1<<i);
	    		flg>>=i;
	    		LCDLine1[i+10]=flg+48;
	    	}
	    	// vyvod flagov rozetok
	    	for (i=0; i<3; i++) {
	    		flg=plugStateFlags&(1<<i);
	    		flg>>=i;
	    		LCDLine1[i+13]=flg+48;
	    	}
	    	LCDLine1[9]=phUnderOver+48;
#endif

	    	vTaskDelay(14);
	    	button=readButtons();
	    	vTaskDelay(3);

	    	if (button==BUTTON_OK)
	    	{
	    		vTaskDelay(100);
	    		Lcd_clear();
	    		vTaskDelay(500);
	    		uint8_t progId=menuSelector();
	    		programRunner(progId);
	    	}
	    	// USART_SendData(BT_USART, 50);
//	    	USART1->DR=55;
	    	vTaskDelay(10);
	    }




    	while (1) {


    	}
}

uint8_t readButtons(void){
	uint16_t curval = 0;
	uint8_t i;
		curval = get_average_adc(10);
		for (i=0;i<4;i++) {
				if (curval>button_ranges[i*2]+BUTTON_RANGE_SHRINKER && curval<button_ranges[i*2+1]-BUTTON_RANGE_SHRINKER) {
					return i+1;
				}

	}
	return 0;


}

void adcRegularInit(void){

}



void AdcInit(void)
{
	// WARNING NTBU (needs to be updated)! shifting pins down to 0 from 1st, saves some space on discovery board
	RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;

	  GPIOA->CRL   &= ~GPIO_CRL_MODE1;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF1;

	  GPIOA->CRL   &= ~GPIO_CRL_MODE2;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF2;

	  GPIOA->CRL   &= ~GPIO_CRL_MODE3;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF3;

	  GPIOA->CRL   &= ~GPIO_CRL_MODE4;
	  GPIOA->CRL   &= ~GPIO_CRL_CNF4;

	  RCC->APB2ENR |=  RCC_APB2ENR_ADC1EN;
	  RCC->CFGR    &= ~RCC_CFGR_ADCPRE;
	  ADC1->CR1     =  0;
	  ADC1->CR2    |=  ADC_CR2_CAL;
	  while (!(ADC1->CR2 & ADC_CR2_CAL)){};
	  ADC1->CR2     =  ADC_CR2_JEXTSEL;
	  ADC1->CR2    |=  ADC_CR2_JEXTTRIG;
	  ADC1->CR2    |=  ADC_CR2_CONT;
	  ADC1->CR1    |=  ADC_CR1_SCAN;
	  ADC1->CR1    |=  ADC_CR1_JAUTO;
	  ADC1->JSQR    =  (uint32_t)(4-1)<<20;
	  ADC1->JSQR   |=  (uint32_t)1<<(5*0);
	  ADC1->JSQR   |=  (uint32_t)2<<(5*1);
	  ADC1->JSQR   |=  (uint32_t)3<<(5*2);
	  ADC1->JSQR   |=  (uint32_t)4<<(5*3);
	  ADC1->SMPR1  |=	0x00FFFFFF;
	  ADC1->CR2    |=  ADC_CR2_ADON;
	  ADC1->CR2    |=  ADC_CR2_JSWSTART;
}

void Lcd_write_digit2(uint8_t numb){
	if (numb<10) {
		Lcd_write_data(48);
		Lcd_write_data(48+numb);
	}
	else {
		Lcd_write_data((numb/10)+48);
		Lcd_write_data((numb-(numb/10)*10)+48);
	}
}

void Lcd_write_digit(uint8_t numb){
	if (lcd_pointery==0) {
		LCDLine1[lcd_pointerx] = ((numb%100)/10)+48;
		lcd_pointerx++;
		LCDLine1[lcd_pointerx] = (numb%10)+48;
		lcd_pointerx++;
	}
	else {
		LCDLine2[lcd_pointerx] = ((numb%100)/10)+48;
		lcd_pointerx++;
		LCDLine2[lcd_pointerx] = (numb%10)+48;
		lcd_pointerx++;
	}
}





void prvSetupHardware()
{
	RCC->APB2ENR |= RCC_APB2ENR_IOPCEN;     // Enable clock on GPIOC.
//	        GPIOC->CRH      &= ~GPIO_CRH_CNF8;              //  Push-Pull. LED PC8
//	        GPIOC->CRH      &= ~GPIO_CRH_CNF9;              //  Push-Pull. LED PC9
	        GPIOC->CRL      &= ~GPIO_CRL_CNF0;		// LOAD triggering from PC0...
	        GPIOC->CRL      &= ~GPIO_CRL_CNF1;
	        GPIOC->CRL      &= ~GPIO_CRL_CNF2;
	        GPIOC->CRL      &= ~GPIO_CRL_CNF3;		// ... to PC3


//	        GPIOC->CRH   |= GPIO_CRH_MODE8_0;       //  10MHz.
	        										// and where is 9? but works without it... maybe it is unnecessary to set 10MHz? Maybe it's default?
	        GPIOC->CRL   |= GPIO_CRL_MODE0_0;
	        GPIOC->CRL   |= GPIO_CRL_MODE1_0;
	        GPIOC->CRL   |= GPIO_CRL_MODE2_0;
	        GPIOC->CRL   |= GPIO_CRL_MODE3_0;
}

/* void prvLedBlink( void *pvParameters )
{
//	uint32_t i;

    while(1) {
        GPIOC->BRR = GPIO_BRR_BR8;
        vTaskDelay(1000);
        GPIOC->BSRR = GPIO_BSRR_BS8;
        vTaskDelay(1500);
//        Init_lcd();
//        Init_lcd();
    }
} */

