plantalog/cadi-gcl/stm32f100/current/main.c
void vTaskLCDdraw(void *pvParameters) {	// draws lcd
//	uint32_t tmp=0;
//	int str;
	for (;;) {
		vTaskSuspendAll();
		Lcd_write_cmd(0x80);	// lcd_goto(0,0)
//		Lcd_goto(0,0);
		Lcd_write_arr(&LCDLine1, 16);
//		xTaskResumeAll();
//		vTaskDelay(15);
//		vTaskSuspendAll();
		Lcd_write_cmd(0x80+0x40);	// lcd_goto(1,0)
		Lcd_write_arr(&LCDLine2, 16);
		xTaskResumeAll();
		vTaskDelay(17);
	}
}


/* void prvLedBlink2( void *pvParameters )
{
//	uint32_t i;

    while(1) {
        GPIOC->BSRR = GPIO_BSRR_BS9;
        vTaskDelay(400);
        GPIOC->BRR = GPIO_BRR_BR9;
        vTaskDelay(400);
    }
} */


void int32str(uint32_t d, char *out)
{
    out[10] = '\0';
    out[9] = '0' + ( d       )    % 10;
    out[8] = '0' + ( d /= 10 )    % 10;
    out[7] = '0' + ( d /= 10 )    % 10;
    out[6] = '0' + ( d /= 10 )    % 10;
    out[5] = '0' + ( d /= 10 )    % 10;
    out[4] = '0' + ( d /= 10 )    % 10;
    out[3] = '0' + ( d /= 10 )    % 10;
    out[2] = '0' + ( d /= 10 )    % 10;
    out[1] = '0' + ( d /= 10 )    % 10;
    out[0] = '0' + ( d /  10 )    % 10;
//    return out;
}

void int10str(uint32_t d, char *out)
{
    out[4] = '\0';
    out[3] = '0' + ( d       )    % 10;
    out[2] = '0' + ( d /= 10 )    % 10;
    out[1] = '0' + ( d /= 10 )    % 10;
    out[0] = '0' + ( d /  10 )    % 10;
//    return out;
}

uint32_t EE_ReadWord(uint16_t Address){
	uint16_t tmp, tmp2;
	uint32_t Data = 0;
	EE_ReadVariable(Address, &tmp);
	EE_ReadVariable(Address+1, &tmp2);
	Data = ((uint32_t)tmp << 16) + (uint32_t)tmp2;
	return Data;
}

void flush_lcd_buffer(void){
	uint8_t i=0;
	for (i=0;i<16;i++){
		LCDLine1[i]=32;
		LCDLine2[i]=32;
	}
}


void setPwmDc(uint8_t duty_cycle){		// duty_cycle in %
	TIM3->CCR3 = duty_cycle*10;
	TIM3->CCR4 = 1000 - duty_cycle*10;
}

void setDutyCycle(void){
	uint8_t button=0, duty_cycle;
	duty_cycle = TIM3->CCR3/10;
	Lcd_clear();
	while (button!=BUTTON_OK) {
		button = readButtons();
		Lcd_goto(0,0);
		Lcd_write_str("Crnt duty cycle");
		Lcd_goto(1,0);
		Lcd_write_digit(duty_cycle);
		if (button==BUTTON_FWD) {
			if (duty_cycle==99) {
			}
			else {
				duty_cycle++;
				setPwmDc(duty_cycle);
			}
		}
		if (button==BUTTON_BCK) {
			if (duty_cycle==0) {
			}
			else {
				duty_cycle--;
				setPwmDc(duty_cycle);
			}
		}
		vTaskDelay(20);
	}
	Lcd_clear();
}

int main(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	SystemInit();
#ifdef USE_VALVES
	valve_motor_control_init();
	stop_valve_motor(0);
	stop_valve_motor(1);
	stop_valve_motor(2);
	stop_valve_motor(3);
#endif

//	valve_status_updater();
	dosing_motor_control_init();
	enable_dosing_pump(0, 0);
	enable_dosing_pump(1, 0);
	enable_dosing_pump(2, 0);
	enable_dosing_pump(3, 0);
//	close_valve(0,1);
	water_sensor_input_init();
	/* Unlock the Flash Program Erase controller */
	FLASH_Unlock();
	/* EEPROM Init */
	EE_Init();
/*	uint32_t tmp;		// pohodu, nenuzhnoe uzhe. 05.06.2013
	char value[10];
	tmp = EE_ReadWord(0x8000);
	int32str(tmp, &value); */
	AdcInit();
	dht_init();
	uint32_t i;
	for (i=0; i<40000; i++) {}
	Init_lcd();

#ifdef USE_VALVES
	valve_feedback_init();
#endif

	bluetooth_init();

	buttonCalibration();
	Lcd_clear();

//	setPwmDc(100);


//	Lcd_goto(1,0);
//	Lcd_write_str(value);
//	for (i=0; i<400000; i++) {}

//	DSTATUS resp=0;
//	  ......
//	  disk_initialize(0);
//	  f_mount(0, &fs);
//	  resp = create_file("0:proba.txt");
//	  create_file("0:proba2.txt");
//	  f_mount(0, NULL);

//	  ......

//		Lcd_clear();
//		Lcd_goto(1,0);
//		Lcd_write_digit(resp);



	prvSetupHardware();		// setup gpio for load triggering and led indication
// reinit valves HARDCODE
#ifdef USE_VALVES
	run_valve_motor(0);
	while (!(((VALVE_SENSOR_PORT->IDR)>>VALVE_SENSOR_GPIO_SHIFT)&1)) {

	}
//	stop_valve_motor(0);
//	run_valve_motor(0);
	while (((VALVE_SENSOR_PORT->IDR)>>VALVE_SENSOR_GPIO_SHIFT) & 1) {

	}
	stop_valve_motor(0);

// drain valve
	run_valve_motor(1);
	while (((VALVE_SENSOR_PORT->IDR)>>VALVE_SENSOR_GPIO_SHIFT+1) & 1) {

	}
//	stop_valve_motor(1);
//	run_valve_motor(1);
	while (!(((VALVE_SENSOR_PORT->IDR)>>VALVE_SENSOR_GPIO_SHIFT+1) & 1)) {

	}
	stop_valve_motor(1);
#endif

//	plugStateSet(3, 1);
//	plugStateSet(2, 1);		// does not work at all. led rojo
//	for (i=0; i<200000; i++) {}
//	plugStateSet(1, 1);
//	for (i=0; i<200000; i++) {}
//	plugStateSet(0, 1);
//	for (i=0; i<400000; i++) {}
//	uint32_t temptime=0;
//	temptime = RTC_GetCounter();
//	if (temptime<10000000 || temptime>20000000) {
//		RTC_SetCounter(YEAR12SECS+(212+20)*86400+10*3600+9*60);	// possibly there are another ways to determine if the clock is already running or not
//	}
	RtcInit();		//init real time clock

	DSTATUS resp=0;		// variable for status response from sd card init function
	no_sd = disk_initialize(0);		// init card
//	loadSettings();
	if (no_sd==0){
		no_sd = f_mount(0, &fs);
		no_sd = string2log("System started\n", 15);
	}


	Lcd_clear();
//	valveFlags=2;
//	Lcd_goto(1,0);
//	Lcd_write_digit(no_sd);
	loadSettings();
	flush_lcd_buffer();	// fills the LCD frame buffer with spaces
//    		for (i=0; i<4000000; i++) {}
//    xTaskCreate(prvLedBlink,(signed char*)"LED",configMINIMAL_STACK_SIZE,
//            NULL, tskIDLE_PRIORITY + 1, NULL);
//    xTaskCreate(prvLedBlink2,(signed char*)"LED2",configMINIMAL_STACK_SIZE,
//            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(displayClock,(signed char*)"CLK",140,
            NULL, tskIDLE_PRIORITY + 2, NULL);
    xTaskCreate(timerStateTrigger,(signed char*)"TIMERS",configMINIMAL_STACK_SIZE,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(plugStateTrigger,(signed char*)"PLUGS",configMINIMAL_STACK_SIZE+35,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(phMonitor,(signed char*)"PHMON",configMINIMAL_STACK_SIZE,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(vTaskLCDdraw,(signed char*)"LCDDRW",configMINIMAL_STACK_SIZE,
            NULL, tskIDLE_PRIORITY + 1, NULL);
    xTaskCreate(watering_program_trigger,(signed char*)"WP",configMINIMAL_STACK_SIZE+80,
            NULL, tskIDLE_PRIORITY + 1, NULL);
if (resp==0){
	xTaskCreate(sdLog,(signed char*)"SDLOG",256,NULL, tskIDLE_PRIORITY + 1, NULL);
}

/* Start the scheduler. */

