plantalog/cadi-gcl/stm32f100/current/main.c
		// ph window bottom
		int10str(phWindowBottom,&tmpstr);
		for (i=0;i<4;i++){
			putstring[i]=tmpstr[i];
		}
		putstring[4] = 10;
		string2log("ph window btm ", 14);
		string2log(putstring, 5);

		string2log("EC 1.413 cal @", 14);
		int10str(ec1413,&tmpstr);
		for (i=0;i<4;i++){
			putstring[i]=tmpstr[i];
		}
		putstring[4] = 10;
		string2log(putstring, 5);
	}

	EE_ReadVariable(SD_LOG_INTERVAL, &logInterval);
	readButtonRanges();
}

void set4highBits(uint8_t dta){		// setting higher 4 bits of word on corresponding GPIO pins
	if (dta&16) lcd_port->BSRRL |= (pin_d4);
	else lcd_port->BSRRH |= (pin_d4);
	if (dta&32) lcd_port->BSRRL |= (pin_d5);
	else lcd_port->BSRRH |= (pin_d5);
	if (dta&64) lcd_port->BSRRL |= (pin_d6);
	else lcd_port->BSRRH |= (pin_d6);
	if (dta&128) lcd_port->BSRRL |= (pin_d7);
	else lcd_port->BSRRH |= (pin_d7);
}


void Lcd_write_str(char *STRING)
{
	char c;
	while (c=*STRING++){
		if (lcd_pointery==0) {
			LCDLine1[lcd_pointerx] = c;
			lcd_pointerx++;
		}
		else {
			LCDLine2[lcd_pointerx] = c;
			lcd_pointerx++;
		}
	}
}

void Lcd_goto(uc8 x,uc8 y)
{
	int str;
	str = y + 0x80;
	if(x == 1)
	{
	str+= 0x40;
	}
	Lcd_write_cmd(str);
	lcd_pointerx = y;
	lcd_pointery = x;
}

void Init_pin_out()
{
	RCC_APB2PeriphClockCmd(init_port, ENABLE);
	GPIO_InitTypeDef init_pin;
	init_pin.GPIO_Pin  = pin_e | pin_rs | pin_rw | pin_d7 | pin_d6 | pin_d5 | pin_d4;
	init_pin.GPIO_Mode = GPIO_Mode_Out_PP;
	init_pin.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init (port, &init_pin);
}

void Init_pin_in()
{
	RCC_APB2PeriphClockCmd(init_port, ENABLE);
	GPIO_InitTypeDef init_pin;
	init_pin.GPIO_Pin  =  pin_d7 | pin_d6 | pin_d5 | pin_d4 ;
	init_pin.GPIO_Mode = GPIO_Mode_IPD;
	init_pin.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init (port, &init_pin);
}

void Lcd_write_cmd(uc8 cmd )
{
		Delay_us(6);	// stable 240
		rs_0;rw_0;e_1;
		Delay_us(1);
		set4highBits(cmd);
		e_0;
		Delay_us(1);
		e_1;
		Delay_us(1);
		set4lowBits(cmd);
		e_0;
		Delay_us(6);
}

void Lcd_write_data(uint8_t data)
{
	Delay_us(6);
	e_1;rs_1;rw_0;
	Delay_us(1);
	set4highBits(data);
	Delay_us(1);
	e_0;
	Delay_us(1);
	e_1;
	Delay_us(1);
	set4lowBits(data);
	Delay_us(1);
	e_0;
	Delay_us(1);
	e_0;rs_0;rw_0;
	Delay_us(6);
}

void set4lowBits(uint8_t dta){
	if (dta&1) lcd_port->BSRRL |= (pin_d4);
	else lcd_port->BSRRH |= (pin_d4);
	if (dta&2) lcd_port->BSRRL |= (pin_d5);
	else lcd_port->BSRRH |= (pin_d5);
	if (dta&4) lcd_port->BSRRL |= (pin_d6);
	else lcd_port->BSRRH |= (pin_d6);
	if (dta&8) lcd_port->BSRRL |= (pin_d7);
	else lcd_port->BSRRH |= (pin_d7);

}

void Init_lcd()
{
	Init_pin_out();
//	  Delay_us(10000);
	  e_1;rs_0;rw_0;
	      Delay_us(100);	// assume 10ms
	      set4lowBits(0b0010);	// set 4 bit bus
	      e_0;
	      Delay_us(10);	// assume 10ms

	      Lcd_write_cmd(0b00101000);	// again, 4bit bus and the rest 4bits of whole command will get the destination now
	      Delay_us(10);
//	  	  del=72000; while (del--){}
	  	  Lcd_write_cmd(Display_clear);
//	      del=72000; while (del--){}

		  Lcd_write_cmd(0b00000110);	// function set
//		  del=72000; while (del--){}

		  Lcd_write_cmd(0b00001100);	// display on cursor off
//		  del=72000; while (del--){}


		  Lcd_write_cmd(Display_clear);	// function set
//		  del=72000; while (del--){}

//		  Lcd_write_str("A");



//		  Lcd_write_str("12345678");


	  	Delay_us(10);
}

void Lcd_clear()
{
	Lcd_write_cmd(Display_clear);
	flush_lcd_buffer();
	Lcd_goto(0,0);
}

void Return_home()
{
	Lcd_write_cmd(0b0000001);
}


